Revit 2027 API
PropertyLine.Create(Document, IList<PropertyTableEntry>) Method
 Creates a new PropertyLine element from property table and adds it to the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PropertyLine Create(
	Document document,
	IList<PropertyTableEntry> pt
)
Public Shared Function Create (
	document As Document,
	pt As IList(Of PropertyTableEntry)
) As PropertyLine
public:
static PropertyLine^ Create(
	Document^ document,
	IList<PropertyTableEntry^>^ pt
)
static member Create :
        document : Document *
        pt : IList<PropertyTableEntry> -> PropertyLine
Parameters
document Document
 The document to be modified.
pt IList<PropertyTableEntry>
 The input of the Property Table.
Return Value
PropertyLine
 The new PropertyLine element.
Exceptions
Exception | Condition
ArgumentException |  Property table is invalid - it refers to either property table size is too less or distance is too short. Another case is for arc type, if the radius value is smaller than half distance. It will also be considered as invalid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to create the new PropertyLine with input property table.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 If the input property table contains any entry that with very short distance. an InvalidOperationException will be thrown.
See Also
Reference
PropertyLine Class
Create Overload
Autodesk.Revit.DB Namespace